<script setup lang="ts">
  
</script>

<template>
  <div class="privacy-policy">
    <h1>隐私条款</h1>

    <p>欢迎您使用悠米商城（以下简称“本站”）。我们致力于保护您的隐私和个人数据，确保您的信息安全。在您使用本站的过程中，可能需要提供个人信息，我们将根据本隐私条款对您的信息进行收集、使用和保护。请您在使用本站之前仔细阅读本隐私条款，以便您了解我们如何处理您的个人信息。</p>

    <h2>1. 信息收集</h2>
    <p>在您使用本站的过程中，我们可能会收集以下类型的信息：</p>
    <ul>
      <li><strong>个人身份信息：</strong>包括您的电子邮件地址、账户信息等。</li>
      <li><strong>支付信息：</strong>包括支付账户信息等，但我们不会存储您的支付账户的完整信息，支付信息通过第三方支付平台进行处理。</li>
      <li><strong>设备信息：</strong>包括您的设备型号、操作系统、IP地址、浏览器类型等。</li>
      <li><strong>交易信息：</strong>包括您在本站上的购买历史、订单信息等。</li>
    </ul>

    <h2>2. 信息的使用</h2>
    <p>我们收集您的个人信息主要用于以下目的：</p>
    <ul>
      <li><strong>账户管理：</strong>帮助您注册、登录账户，提供订单管理、售后服务等功能。</li>
      <li><strong>订单处理：</strong>完成订单处理，包括订单确认、商品发货、售后服务等。</li>
      <li><strong>支付处理：</strong>确保您的支付信息得到有效处理并进行安全验证。</li>
      <li><strong>改进服务：</strong>分析您的使用行为，以改进本站的功能和用户体验。</li>
      <li><strong>法律合规：</strong>遵守相关法律法规的要求，以及应对法律纠纷、调查等需要。</li>
    </ul>

    <h2>3. 信息共享与披露</h2>
    <p>我们承诺不会向第三方泄露您的个人信息，除非在以下情况下：</p>
    <ul>
      <li><strong>法律要求：</strong>在法律、法规要求的情况下，我们可能需要披露您的个人信息，例如配合政府执法机关的要求，或在诉讼中履行我们的义务。</li>
      <li><strong>业务转让：</strong>在本站进行资产转让、合并、收购或其他业务重组的情况下，您的个人信息可能会作为业务的一部分被转移，但我们将尽力确保您的信息得到同等程度的保护。</li>
    </ul>

    <h2>4. 信息安全</h2>
    <p>我们非常重视您的信息安全，采取了合理的技术措施和管理手段，防止您的个人信息遭受未经授权的访问、泄露、篡改或毁损。然而，无法保证通过互联网传输的任何数据在传输过程中是完全安全的，因此请您在使用我们的服务时，注意保护个人信息，避免泄露敏感信息。</p>

    <h2>5. 用户的权利</h2>
    <p>根据相关法律法规，您有权：</p>
    <ul>
      <li><strong>访问和修改：</strong>您可以随时查看和修改您的个人信息。</li>
      <li><strong>删除：</strong>您可以要求我们删除不再必要的个人信息，或在不违反法律法规的前提下请求删除账户。</li>
      <li><strong>撤销同意：</strong>如果您不希望我们继续处理您的个人信息，您可以撤销同意，但这可能会影响您继续使用本站部分功能。</li>
      <li><strong>数据传输：</strong>您可以要求我们提供您的个人信息的电子副本，以便向其他服务提供商传输。</li>
    </ul>

    <h2>6. Cookies和其他跟踪技术</h2>
    <p>我们可能会使用Cookies或类似技术来提高您的使用体验。Cookies是存储在您的设备上的小型文本文件，帮助我们了解您的使用习惯、偏好设置等。您可以通过浏览器设置管理或禁用Cookies，但这可能会影响本站的部分功能。</p>

    <h2>7. 未成年人隐私保护</h2>
    <p>本站不专门面向未成年人，且我们不会故意收集未成年人的个人信息。如果您是未成年人的监护人，并发现您的孩子向我们提供了个人信息，请联系我们，我们将在确认后尽快删除相关信息。</p>

    <h2>8. 隐私条款的更新</h2>
    <p>我们可能会根据业务需求或法律法规的变化更新本隐私条款。更新后的隐私条款将在本站内发布，并即时生效。建议您定期查看隐私条款，以了解最新的隐私保护措施。</p>

    <h2>9. 联系我们</h2>
    <p>如果您对本隐私条款有任何疑问或需要行使您的权利，欢迎通过以下方式联系我们：</p>
    <ul>
      <li>联系邮箱：<a href="mailto:uomiss@mail8.cc">uomiss@mail8.cc</a></li>
    </ul>

    <p>感谢您选择使用我们的悠米商城，我们承诺为您的隐私和数据安全保驾护航。</p>

    <footer>
      <p>最后更新：2024年04月25日</p>
    </footer>
  </div>
</template>

<style scoped lang="less">
  .privacy-policy {
    font-family: Arial, sans-serif;
    line-height: 1.6;
    padding: 20px;
    max-width: 800px;
    margin: 0 auto;
  }

  h1 {
    text-align: center;
    font-size: 24px;
    margin-bottom: 20px;
  }

  h2 {
    font-size: 20px;
    margin-top: 20px;
    margin-bottom: 10px;
  }

  ul {
    margin-left: 20px;
  }

  li {
    margin-bottom: 8px;
  }

  footer {
    text-align: center;
    margin-top: 30px;
    font-size: 14px;
    color: #777;
  }
</style>
